# ForeignFile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ForeignFileFailures..::..ForeignFile Property
BuiltInFailures..::..ForeignFileFailures Class See Also
---
This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ForeignFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ForeignFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ForeignFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ForeignFileFailures Class
Autodesk.Revit.DB Namespace